package cmds

import (
	"fmt"
	"to-do/logs"
)

func EmptyInput() {
	fmt.Println("Вы ввели пустую строку")
	fmt.Println("Пожалуйста, введите команду, help покажет список команд")
}

func Exit(text []string) bool {
	if len(text) > 1 {
		logs.NewLog(logs.Counter, "Пользователь ввел exit с лишними аргументами")
		fmt.Println("Команда exit не принимает аргументов, введите help для вывода доступных команд")
		return false
	}
	logs.NewLog(logs.Counter, "Пользователь завершил выполнение программы")
	fmt.Println("ВЫХОД...")
	return true
}

func Help(text []string) {
	if len(text) > 1 {
		logs.NewLog(logs.Counter, "Пользователь ввел help с лишними аргументами")
		fmt.Println("Команда help не принимает аргументов, введите help без аргументов для вывода доступных команд")
	} else {
		logs.NewLog(logs.Counter, "Пользователь вывел список команд")
		fmt.Println(`Список команд:

// Команды приложения

exit — завершить текущую сессию

help — вывести список доступных команд и флагов

logs — вывести логи текущей сессии

// Команды задач

list [-c <название категории>] — вывести список всех задач, а с флагом <-c> список задач по категории

add <название> [-d <описание>] [-c <категория>] [-t <дедлайн (ГГГГ.ММ.ДД ЧЧ:ММ)>] — создать задачу, с помощью флагов можно задать описание, категорию и дедлайн

del <название> — удалить задачу

done <название> — отметить задачу выполненной

undone <название> — отметить задачу невыполненной

change <название> [-nt <новое название>] [-nd <новое описание>] [-nc <новая категория>] [-ncd <новая дата создания>] [-ntd <новый дедлайн>] [-ndd <новая дата выполнения>] — изменить задачу, все даты в формате ГГГГ.ММ.ДД ЧЧ:ММ`)
		fmt.Println("")
	}
}

func ShowLogs(text []string) {
	if len(text) > 1 {
		logs.NewLog(logs.Counter, "Пользователь ввел logs с лишними аргументами")
		fmt.Println("Команда logs не принимает аргументов, введите help для вывода доступных команд")
	} else {
		logs.NewLog(logs.Counter, "Пользователь посмотрел логи программы")
		fmt.Println("======== Логи программы ========")
		for _, v := range logs.Logs {
			fmt.Println(v)
		}
	}
}

func WrongInput(text []string) {
	logs.NewLog(logs.Counter, "Пользователь ввел неизвестную команду: "+text[0])
	fmt.Println("Вы ввели неизвестную команду")
	fmt.Println("Пожалуйста, введите команду, help покажет список команд")
}
